# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. üôÇ

In [1]:
# Import here.
import pandas as pd
import numpy as np

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you‚Äôll‚Äïof course‚Äïovercome them with what you learned in class! üòâ

## Food Choices Data Set

### Load the Data

In [2]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = 'data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)

### Explore the Data

How much data did you just load?

In [3]:
# Count by hand. (lol kidding)
len(df_food)

125

What are the columns and their types in this data set?

In [4]:
# Show the column names and their types.
df_food.dtypes

GPA                  object
Gender                int64
breakfast             int64
calories_chicken      int64
calories_day        float64
                     ...
type_sports          object
veggies_day           int64
vitamins              int64
waffle_calories       int64
weight               object
Length: 61, dtype: object

### Clean the Data

Perhaps we‚Äôd like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. ‚Ä¶and maybe gender.

Can you remove the other columns?

In [5]:
# Remove ‚Äòem.
df_food = df_food[['calories_day','weight','Gender']]

What about `NaN`s? How many are there?

In [6]:
# Count ‚Äòem.

df_food.isnull().sum()

calories_day    19
weight           2
Gender           0
dtype: int64

We gotta remove those `NaN`s‚Äïthe entire row.

In [7]:
# Drop ‚Äòem.

df_food = df_food.dropna()

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. ü§î

In [8]:
# Fix that
def string_to_int(txt):
    try:
        return int(txt)
    except:
        try:
            lst = [int(s) for s in txt.split(' ') if s.isdigit()]
            return lst[0]
        except:
            return None

df_food['weight'] = df_food['weight'].apply(string_to_int)
df_food = df_food.dropna(subset=['weight'])
df_food

     calories_day  weight  Gender
1             3.0   155.0       1
3             3.0   240.0       1
4             2.0   190.0       1
5             3.0   190.0       1
6             3.0   180.0       2
..            ...     ...     ...
118           3.0   140.0       1
119           3.0   185.0       2
120           4.0   156.0       1
121           2.0   180.0       1
123           4.0   135.0       2

[103 rows x 3 columns]

Now this data seems reasonably clean for our purposes! üòÅ

Let‚Äôs save it somewhere to be shipped off to another teammate. üíæ

In [9]:
# Savey save!
df_food.to_csv('data/food_coded_cleaned.csv',index=False)

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [10]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
df_salary = pd.read_csv('data/Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv',sep='\t')
df_salary

,Timestamp,How old are you?,What industry do you work in?,Job title,"If your job title needs additional context, please clarify here:","What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)","How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.",Please indicate the currency,"If ""Other,"" please indicate the currency here:","If your income needs additional context, please provide it here:",What country do you work in?,"If you're in the U.S., what state do you work in?",What city do you work in?,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,What is your race? (Choose all that apply.)
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28057,7/12/2024 22:52:01,35-44,Health care,Veterinarian,NaN,135000,NaN,USD,NaN,NaN,United States,Missouri,Wentzville,11 - 20 years,11 - 20 years,"Professional degree (MD, JD, etc.)",Woman,White
28058,7/23/2024 17:51:03,25-34,Computing or Tech,Systems Architect,NaN,109000,NaN,USD,NaN,NaN,USA,Georgia,Atlanta,5-7 years,5-7 years,College degree,Man,White
28059,7/24/2024 12:22:58,18-24,"Accounting, Banking & Finance",Risk Management Associate,NaN,1200,0.0,USD,NaN,NaN,Myanmar,Colorado,Yangon,2 - 4 years,2 - 4 years,Some college,Man,Asian or Asian American
28060,7/26/2024 11:20:45,18-24,Computing or Tech,IT,NaN,1700,10.0,USD,NaN,NaN,Burma,NaN,Yangon,2 - 4 years,1 year or less,Some college,Man,Asian or Asian American
28061,8/20/2024 1:06:13,25-34,Health care,Clinical physiologist,NaN,1200000,NaN,Other,NGN,NaN,Nigeria,NaN,Lagos,2 - 4 years,2 - 4 years,College degree,Woman,Black or African American

Was that hard? üôÉ

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

In [11]:
df_salary.to_csv('data/manager_salary_survey.tsv',sep='\t',index=False)

### Explore

You know the drill.

How much data did you just load?

In [12]:
# Count by hand. I‚Äôm dead serious.
df_salary_renamed = pd.read_csv('data/manager_salary_survey.tsv',sep='\t')
len(df_salary_renamed)

28062

What are the columns and their types?

In [13]:
# Show the column names and their types.

df_salary_renamed.dtypes

Timestamp                                                                                                                                                                                                                                object
How old are you?                                                                                                                                                                                                                         object
What industry do you work in?                                                                                                                                                                                                            object
Job title                                                                                                                                                                                                                                object
If your job title needs additional context, please clarify here:                                                                                                                                                                         object
What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)     object
How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                          float64
Please indicate the currency                                                                                                                                                                                                             object
If "Other," please indicate the currency here:                                                                                                                                                                                           object
If your income needs additional context, please provide it here:                                                                                                                                                                         object
What country do you work in?                                                                                                                                                                                                             object
If you're in the U.S., what state do you work in?                                                                                                                                                                                        object
What city do you work in?                                                                                                                                                                                                                object
How many years of professional work experience do you have overall?                                                                                                                                                                      object
How many years of professional work experience do you have in your field?                                                                                                                                                                object
What is your highest level of education completed?                                                                                                                                                                                       object
What is your gender?                                                                                                                                                                                                                     object
What is your race? (Choose all that apply.)                                                                                                                                                                                              object
dtype: object

Oh‚Ä¶ Ugh! Give these columns easier names to work with first. üôÑ

In [14]:
# Rename ‚Äòem.
# Non-binding suggestions: timestamp, age, industry, title, title_context, salary, additional_compensation, currency, other_currency, salary_context, country, state, city, total_yoe, field_yoe, highest_education_completed	gender, race
col_dict = {
    "How old are you?":"Age",
    "What industry do you work in?":"Industry",
    "If your job title needs additional context, please clarify here:":"Job Context",
    "What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)":"Annual Salary",
    "How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.":"Additional Payments",
    "Please indicate the currency":"Currency",
    "If \"Other,\" please indicate the currency here:":"Currency Other",
    "If your income needs additional context, please provide it here:":"Income Extra Context",
    "What country do you work in?":"Country of Work",
    "If you're in the U.S., what state do you work in?":"U.S State If Applicable",
    "What city do you work in?":"City of Work",
    "How many years of professional work experience do you have overall?":"Years of Experience",
    "How many years of professional work experience do you have in your field?":"Field Years of experience",
    "What is your highest level of education completed?":"education level",
    "What is your gender? ":"Gender",
    "What is your race? (Choose all that apply.)":"Race(s)"
    
}
df_salary_renamed.rename(col_dict,axis=1,inplace=True)

adjusted_col_names = []
for col in df_salary_renamed.columns:
    good_format = col.strip().lower().replace(' ', '_')
    print('old-->', col, '\t new-->', good_format)
    adjusted_col_names.append(good_format)
df_salary_renamed.columns = adjusted_col_names

df_salary_renamed.head()

old--> Timestamp 	 new--> timestamp
old--> Age 	 new--> age
old--> Industry 	 new--> industry
old--> Job title 	 new--> job_title
old--> Job Context 	 new--> job_context
old--> Annual Salary 	 new--> annual_salary
old--> Additional Payments 	 new--> additional_payments
old--> Currency 	 new--> currency
old--> If "Other," please indicate the currency here:  	 new--> if_"other,"_please_indicate_the_currency_here:
old--> Income Extra Context 	 new--> income_extra_context
old--> Country of Work 	 new--> country_of_work
old--> U.S State If Applicable 	 new--> u.s_state_if_applicable
old--> City of Work 	 new--> city_of_work
old--> Years of Experience 	 new--> years_of_experience
old--> Field Years of experience 	 new--> field_years_of_experience
old--> education level 	 new--> education_level
old--> What is your gender? 	 new--> what_is_your_gender?
old--> Race(s) 	 new--> race(s)

,timestamp,age,industry,job_title,job_context,annual_salary,additional_payments,currency,"if_""other,""_please_indicate_the_currency_here:",income_extra_context,country_of_work,u.s_state_if_applicable,city_of_work,years_of_experience,field_years_of_experience,education_level,what_is_your_gender?,race(s)
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White

It‚Äôs a lot, and that should not have been easy. üòè

You‚Äôre going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [15]:
# List the unique industries and a count of their instances.
df_salary_renamed['industry'].value_counts()

industry
Computing or Tech                          4699
Education (Higher Education)               2464
Nonprofits                                 2419
Health care                                1896
Government and Public Administration       1889
                                           ...
Gaming (Gambling)                             1
Regulatory Affairs- nutraceuticals            1
Manufacturing : corporate admin support       1
Real Estate Investment Support                1
Wine & Spirits                                1
Name: count, Length: 1219, dtype: int64

That value among the top 5 is what you‚Äôre looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [16]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
df_salary_comp = df_salary_renamed[df_salary_renamed['industry'] == 'Computing or Tech']
df_salary_comp.head()

,timestamp,age,industry,job_title,job_context,annual_salary,additional_payments,currency,"if_""other,""_please_indicate_the_currency_here:",income_extra_context,country_of_work,u.s_state_if_applicable,city_of_work,years_of_experience,field_years_of_experience,education_level,what_is_your_gender?,race(s)
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [17]:
# Sanity Check 
df_salary_comp['industry'].value_counts()

industry
Computing or Tech    4699
Name: count, dtype: int64

We are very interested in salary figures. But how many dollars üíµ is a euro üí∂ or a pound üí∑? That sounds like a problem for another day. ü´†

For now, let‚Äôs just look at U.S. dollars (`'USD'`).

In [18]:
# Filtery filter for just the jobs that pay in USD!
df_salary_comp_usd = df_salary_comp[df_salary_comp['currency'] == 'USD']
df_salary_comp_usd

,timestamp,age,industry,job_title,job_context,annual_salary,additional_payments,currency,"if_""other,""_please_indicate_the_currency_here:",income_extra_context,country_of_work,u.s_state_if_applicable,city_of_work,years_of_experience,field_years_of_experience,education_level,what_is_your_gender?,race(s)
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
47,4/27/2021 11:04:09,35-44,Computing or Tech,Product Design Director,NaN,"200,850",40000.0,USD,NaN,NaN,USA,North Carolina,Chapel Hill,11 - 20 years,11 - 20 years,College degree,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28044,6/3/2024 16:15:43,18-24,Computing or Tech,Research Data Analyst Associate,NaN,60000,0.0,USD,NaN,NaN,United States,Illinois,Evanston,2 - 4 years,1 year or less,College degree,Woman,White
28051,7/1/2024 20:05:58,25-34,Computing or Tech,Junior data analyst,NaN,35000,15000.0,USD,NaN,NaN,Usa,Alabama,Alabama,2 - 4 years,2 - 4 years,College degree,Woman,Black or African American
28052,7/3/2024 14:02:01,25-34,Computing or Tech,Senior Global Public Relations Manager,NaN,144000,15000.0,USD,NaN,NaN,Usa,Massachusetts,Boise-but remote. Company located in Boston,8 - 10 years,8 - 10 years,Master's degree,Woman,White
28058,7/23/2024 17:51:03,25-34,Computing or Tech,Systems Architect,NaN,109000,NaN,USD,NaN,NaN,USA,Georgia,Atlanta,5-7 years,5-7 years,College degree,Man,White
28060,7/26/2024 11:20:45,18-24,Computing or Tech,IT,NaN,1700,10.0,USD,NaN,NaN,Burma,NaN,Yangon,2 - 4 years,1 year or less,Some college,Man,Asian or Asian American

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [19]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.
df_salary_comp_usd['country_of_work'].value_counts()

country_of_work
United States               1576
USA                         1222
US                           412
U.S.                         108
United States of America      90
                            ...
Pakistan                       1
Puerto Rico                    1
America                        1
Uniyed states                  1
Burma                          1
Name: count, Length: 76, dtype: int64

### Clean the Data

Well, we can‚Äôt get our answers with what we currently have, so you‚Äôll have to make some changes.

Let‚Äôs not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value‚Äïsay, `'US'`, which is nice and short.

In [20]:
# Replace them all with 'US'.
usa_dict = {'United States':'US',
            "USA":"US",
            "U.S.":"US",
            "United States of America":"US"}
df_salary_comp_usd = df_salary_comp_usd.replace(usa_dict)

Have a look at the count of each unique country again now.

In [21]:
# Count again.

df_salary_comp_usd['country_of_work'].value_counts()

country_of_work
US                3408
United States       68
Usa                 59
USA                 56
usa                 28
                  ...
Mexico               1
United Stateds       1
ISA                  1
singapore            1
Burma                1
Name: count, Length: 72, dtype: int64

Did you notice anything interesting?

In [22]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.
def adjust(x):
    return x.lower().strip()
df_salary_comp_usd['country_of_work'] = df_salary_comp_usd['country_of_work'].apply(adjust)
usa_dict = {"us":"US", 
            "usa":"US", 
            "united states":"US", 
            "u.s":"US", 
            "u.s.":"US", 
            "u.s.a":"US", 
            "u.s.a.":"US", 
            "united states of america":"US",
            "united state of america":"US"}
df_salary_comp_usd['country_of_work'] = df_salary_comp_usd['country_of_work'].replace(usa_dict)

df_salary_comp_usd['country_of_work'].value_counts()

country_of_work
US                      3712
israel                     5
canada                     5
nigeria                    2
denmark                    2
france                     2
poland                     2
new zealand                2
brazil                     2
spain                      2
singapore                  2
india                      2
united kingdom             2
unitedstates               2
unite states               2
australia                  2
puerto rico                1
romania                    1
japan                      1
united stares              1
australian                 1
jamaica                    1
china                      1
unites states              1
thailand                   1
colombia                   1
ghana                      1
america                    1
ss                         1
san francisco              1
netherlands                1
international              1
united state               1
pakistan                   1
isa                        1
united stateds             1
uniyed states              1
mexico                     1
cuba                       1
uruguay                    1
danmark                    1
italy                      1
remote (philippines)       1
united stated              1
burma                      1
Name: count, dtype: int64

In [23]:

# BONUS CREDIT: if you‚Äôve resolved it, let‚Äôs see how well you did by counting the number of instances of each unique value.

It‚Äôs looking good so far. Let‚Äôs find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [24]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.
comp_usd = df_salary_comp_usd.groupby('u.s_state_if_applicable')
comp_usd['annual_salary'].agg(['mean','max'])

TypeError: agg function failed [how->mean,dtype->object]

Well, pooh! We forgot that `salary` isn‚Äôt numeric. Something wrong must be fixed.

In [26]:
# Fix it.
def remove_comma(x):
    filler = x.split(',')
    y = ''.join(filler)
    return (float(y))

df_salary_comp_usd['annual_salary'] = df_salary_comp_usd['annual_salary'].apply(remove_comma).round(2)

Let‚Äôs try that again.

In [28]:
# Try it again. Yeah!
df_g = df_salary_comp_usd.groupby('u.s_state_if_applicable')
df_g['annual_salary'].agg(['mean','max']).round(2)

                                    mean       max
u.s_state_if_applicable
Alabama                         92510.00  350000.0
Alabama, District of Columbia  156000.00  156000.0
Alabama, Montana                72000.00   72000.0
Alaska                         112500.00  158000.0
Arizona                        104491.89  210000.0
...                                  ...       ...
Vermont                        111781.25  200000.0
Virginia                       127706.36  450000.0
Washington                     151423.67  950000.0
West Virginia                  120500.00  125000.0
Wisconsin                      114268.00  920000.0

[66 rows x 2 columns]

That did the trick! Now let‚Äôs narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [30]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.
df_salary_comp_usd['timestamp'] = pd.to_datetime(arg=df_salary_comp_usd['timestamp'])
df_salary_comp_usd[(df_salary_comp_usd['timestamp'] >= pd.to_datetime('01/01/2021')) & (df_salary_comp_usd['timestamp'] <= pd.to_datetime('01/01/2024'))]

,timestamp,age,industry,job_title,job_context,annual_salary,additional_payments,currency,"if_""other,""_please_indicate_the_currency_here:",income_extra_context,country_of_work,u.s_state_if_applicable,city_of_work,years_of_experience,field_years_of_experience,education_level,what_is_your_gender?,race(s)
8,2021-04-27 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,112000.0,10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,2021-04-27 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,187500.0,5000.0,USD,NaN,NaN,US,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,2021-04-27 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,110000.0,20000.0,USD,NaN,"Around 20,000 a year in stock",US,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,2021-04-27 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,144600.0,2500.0,USD,NaN,NaN,US,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
47,2021-04-27 11:04:09,35-44,Computing or Tech,Product Design Director,NaN,200850.0,40000.0,USD,NaN,NaN,US,North Carolina,Chapel Hill,11 - 20 years,11 - 20 years,College degree,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27960,2023-05-09 17:57:30,45-54,Computing or Tech,Junior Data Analyst,NaN,65000.0,0.0,USD,NaN,NaN,US,Virginia,Richmond,21 - 30 years,1 year or less,College degree,Man,White
27961,2023-05-28 16:10:53,45-54,Computing or Tech,Data Analyst,NaN,65000.0,0.0,USD,NaN,NaN,US,New York,Bronx,21 - 30 years,8 - 10 years,College degree,Man,Black or African American
27971,2023-08-08 07:12:10,25-34,Computing or Tech,Data scientist,NaN,500.0,NaN,USD,NaN,NaN,ghana,NaN,Accra,2 - 4 years,2 - 4 years,College degree,Man,Black or African American
27975,2023-09-08 12:35:45,18-24,Computing or Tech,intern,NaN,35000.0,0.0,USD,NaN,NaN,US,Texas,Dallas,1 year or less,1 year or less,Master's degree,Man,Asian or Asian American
27989,2023-10-26 08:17:05,18-24,Computing or Tech,Ibterb,NaN,456.0,NaN,USD,NaN,NaN,nigeria,NaN,Lagos,2 - 4 years,2 - 4 years,College degree,Man,Another option not listed here or prefer not t...

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you‚Äôve now reached. What do you notice about Delaware and West Virginia?

Let‚Äôs back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

In [31]:
df_usd = df_salary_renamed[df_salary_renamed['currency'] == 'USD']
usa_dict = {'United States':'US',
            "USA":"US",
            "U.S.":"US",
            "United States of America":"US"}
df_usd = df_usd.replace(usa_dict)
df_usd['country_of_work'] = df_usd['country_of_work'].apply(adjust)
usa_dict2 = {"us":"US", 
            "usa":"US", 
            "united states":"US", 
            "u.s":"US", 
            "u.s.":"US", 
            "u.s.a":"US", 
            "u.s.a.":"US", 
            "united states of america":"US",
            "united state of america":"US"}
df_usd['country_of_work'] = df_usd['country_of_work'].replace(usa_dict2)
df_usd['annual_salary'] = df_usd['annual_salary'].apply(remove_comma)
state_salary = df_usd.groupby('u.s_state_if_applicable')['annual_salary'].agg(['mean','max']).round(2)
state_salary

                                    mean        max
u.s_state_if_applicable
Alabama                         69237.80   350000.0
Alabama, Alaska, Arizona           15.00       15.0
Alabama, California             29120.00    29120.0
Alabama, District of Columbia  156000.00   156000.0
Alabama, Kansas                 64197.00    64197.0
...                                  ...        ...
Virginia                        94685.35  1300000.0
Washington                     107830.31  1260000.0
West Virginia                   58664.17   125000.0
Wisconsin                       76351.45   920000.0
Wyoming                         58089.29   140000.0

[133 rows x 2 columns]

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

In [40]:
state_salary.style.format('${:.2f}')

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum‚Äïsay 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you‚Äïlike say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* üòú)